pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.c
  * @brief          : Main program body
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */
/* Includes ------------------------------------------------------------------*/
#include "main.h"
#include "cmsis_os.h"
#include "lwip.h"
#include "usb_host.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "lwip/udp.h"
#include <string.h>
#include "../../BSP/STM32746G-Discovery/stm32746g_discovery.h"
#include "../../Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_lcd.h"
#include "../../Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_ts.h"
#include "../../Drivers/BSP/STM32746G-Discovery/stm32746g_discovery_camera.h"
#include "ip4_addr.h"
#include "conf_network.h"
#include "socket_client.h"
#include "analiza_obrazu.h"
//#include "apps/httpd.h"
//#include "lwip/apps/httpd.h"
/* USER CODE END Includes */

/* Private typedef -----------------------------------------------------------*/
/* USER CODE BEGIN PTD */
union _uniaIP
{
	uint32_t u32;
	struct ip4_addr ip;
	uint8_t u8[4];
} uniaIP;
/* USER CODE END PTD */

/* Private define ------------------------------------------------------------*/
/* USER CODE BEGIN PD */


/* USER CODE END PD */

/* Private macro -------------------------------------------------------------*/
/* USER CODE BEGIN PM */

/* USER CODE END PM */

/* Private variables ---------------------------------------------------------*/
ADC_HandleTypeDef hadc3;

CRC_HandleTypeDef hcrc;

DCMI_HandleTypeDef hdcmi;

DMA2D_HandleTypeDef hdma2d;

I2C_HandleTypeDef hi2c1;
I2C_HandleTypeDef hi2c3;

LTDC_HandleTypeDef hltdc;

QSPI_HandleTypeDef hqspi;

RTC_HandleTypeDef hrtc;

SAI_HandleTypeDef hsai_BlockA2;
SAI_HandleTypeDef hsai_BlockB2;

SD_HandleTypeDef hsd1;

SPDIFRX_HandleTypeDef hspdif;

SPI_HandleTypeDef hspi2;

TIM_HandleTypeDef htim1;
TIM_HandleTypeDef htim2;
TIM_HandleTypeDef htim3;
TIM_HandleTypeDef htim5;
TIM_HandleTypeDef htim8;
TIM_HandleTypeDef htim12;

UART_HandleTypeDef huart1;
UART_HandleTypeDef huart6;

SDRAM_HandleTypeDef hsdram1;

osThreadId defaultTaskHandle;
/* USER CODE BEGIN PV */
osThreadId lwipWriteTaskHandle;
osThreadId lwipReadTaskHandle;
uint8_t chBuforTerminala[2048] __attribute__((section(".BuforKamery")));
uint8_t chRodzajWyswietlania = 0;
volatile uint8_t chZdjecieGotowe;
/* USER CODE END PV */

/* Private function prototypes -----------------------------------------------*/
void SystemClock_Config(void);
void PeriphCommonClock_Config(void);
static void MPU_Config(void);
static void MX_GPIO_Init(void);
static void MX_ADC3_Init(void);
static void MX_CRC_Init(void);
static void MX_DCMI_Init(void);
static void MX_DMA2D_Init(void);
static void MX_FMC_Init(void);
static void MX_I2C1_Init(void);
static void MX_I2C3_Init(void);
static void MX_LTDC_Init(void);
static void MX_QUADSPI_Init(void);
static void MX_RTC_Init(void);
static void MX_SAI2_Init(void);
static void MX_SDMMC1_SD_Init(void);
static void MX_SPDIFRX_Init(void);
static void MX_SPI2_Init(void);
static void MX_TIM1_Init(void);
static void MX_TIM2_Init(void);
static void MX_TIM3_Init(void);
static void MX_TIM5_Init(void);
static void MX_TIM8_Init(void);
static void MX_TIM12_Init(void);
static void MX_USART1_UART_Init(void);
static void MX_USART6_UART_Init(void);
void StartDefaultTask(void const * argument);

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private user code ---------------------------------------------------------*/
/* USER CODE BEGIN 0 */
// Funkcja wykrywa nacisnięcie przycisku ekranowego
//zwraca wynik w postaci tabeli gdzie 1 oznacza przycisk naciśnięty
void WykryjNacisniecie(TS_StateTypeDef *touch, uint8_t *chTabPrzyc)
{
	uint8_t n;

	for (n=0; n<2*LICZBA_PRZYCISKOW; n++)
		*(chTabPrzyc + n) = 0;	//inicjuj tablicę

	if (!touch->touchDetected)
		return;

	for (n=0; n<LICZBA_PRZYCISKOW; n++)
	{
		if ((touch->touchX[0] >= KLAW_POZ_X1)  && (touch->touchX[0] < KLAW_POZ_X2)  && (touch->touchY[0] >= (KLAW1_Y + n*KLAW_ROZSTAW_Y)) && (touch->touchY[0] < (KLAW1_Y + n*KLAW_ROZSTAW_Y + KLAW_ROZM_Y)))
			*(chTabPrzyc + n * 2 + 0) = 1;
		if ((touch->touchX[0] >= KLAW_POZ_X2)  && (touch->touchY[0] >= (KLAW1_Y + n*KLAW_ROZSTAW_Y)) && (touch->touchY[0] < (KLAW1_Y + n*KLAW_ROZSTAW_Y + KLAW_ROZM_Y)))
			*(chTabPrzyc + n * 2 + 1) = 1;
	}
}


////////////////////////////////////////////////////////////////////////////////
// Aktywne oczekiwanie na zmianę stanu zmiennej z timeoutem
// Parametry:
// [we] *chBit - wskaźnik na zmienną typu volatile, która ma zmienić swój stan w przerwaniu
// [we] sTimeout - czas oczekiwania liczony w obiegach pętli
// Zwraca: systemowy kod błędu
////////////////////////////////////////////////////////////////////////////////
uint8_t CzekajNaBit(volatile uint8_t *chBit, uint16_t sTimeout)
{
	do
	{
		sTimeout--;
	}
	while (sTimeout && (*chBit == 0));

	if (sTimeout)
		return ERR_OK;
	else
		return ERR_TIMEOUT;
}

/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  * @retval int
  */
int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MPU Configuration--------------------------------------------------------*/
  MPU_Config();

  /* Enable the CPU Cache */

  /* Enable I-Cache---------------------------------------------------------*/
  SCB_EnableICache();

  /* Enable D-Cache---------------------------------------------------------*/
  SCB_EnableDCache();

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

