pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
  /*Configure GPIO pins : TP3_Pin NC2_Pin */
  GPIO_InitStruct.Pin = TP3_Pin|NC2_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(GPIOH, &GPIO_InitStruct);

  /*Configure GPIO pin : DCMI_PWR_EN_Pin */
  GPIO_InitStruct.Pin = DCMI_PWR_EN_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(DCMI_PWR_EN_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : LCD_INT_Pin */
  GPIO_InitStruct.Pin = LCD_INT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_EVT_RISING;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(LCD_INT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pin : ULPI_NXT_Pin */
  GPIO_InitStruct.Pin = ULPI_NXT_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(ULPI_NXT_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ARDUINO_D4_Pin ARDUINO_D2_Pin EXT_RST_Pin */
  GPIO_InitStruct.Pin = ARDUINO_D4_Pin|ARDUINO_D2_Pin|EXT_RST_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_LOW;
  HAL_GPIO_Init(GPIOG, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_STP_Pin ULPI_DIR_Pin */
  GPIO_InitStruct.Pin = ULPI_STP_Pin|ULPI_DIR_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

  /*Configure GPIO pin : RMII_RXER_Pin */
  GPIO_InitStruct.Pin = RMII_RXER_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_INPUT;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  HAL_GPIO_Init(RMII_RXER_GPIO_Port, &GPIO_InitStruct);

  /*Configure GPIO pins : ULPI_CLK_Pin ULPI_D0_Pin */
  GPIO_InitStruct.Pin = ULPI_CLK_Pin|ULPI_D0_Pin;
  GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
  GPIO_InitStruct.Pull = GPIO_NOPULL;
  GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
  GPIO_InitStruct.Alternate = GPIO_AF10_OTG_HS;
  HAL_GPIO_Init(GPIOA, &GPIO_InitStruct);

/* USER CODE BEGIN MX_GPIO_Init_2 */
/* USER CODE END MX_GPIO_Init_2 */
}

/* USER CODE BEGIN 4 */
void vApplicationIdleHook( void )
{

}

/* USER CODE END 4 */

/* USER CODE BEGIN Header_StartDefaultTask */
/**
  * @brief  Function implementing the defaultTask thread.
  * @param  argument: Not used
  * @retval None
  */
/* USER CODE END Header_StartDefaultTask */
void StartDefaultTask(void const * argument)
{
  /* init code for USB_HOST */
  MX_USB_HOST_Init();

  /* init code for LWIP */
  MX_LWIP_Init();
  /* USER CODE BEGIN 5 */
  //const char* message = "Hello UDP message!\n\r";
  static uint8_t bufor_kamery[1280 * 1024 * 2] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_okna[320 * 240 * 2] __attribute__((section(".BuforLCD1")));
  //static uint8_t bufor_ekranu[480 * 272 * 4] __attribute__((section(".BuforLCD0")));
  static uint8_t bufor_czarnobialy[320 * 240] __attribute__((section(".BuforKamery")));
  static uint8_t bufor_cbOut[320 * 240] __attribute__((section(".BuforKamery")));
  char chNapis[DLUGOSC_NAPISU];
  uint8_t chZrobione = 0;
  uint8_t n, chFilm = 0;
  TS_StateTypeDef touch;
  extern float fImag;
  extern float fX, fY, fZoom;
  extern uint8_t chMnozPalety;
  uint8_t chWskWiersza = 0;
  uint8_t chTabPrzyciskow[2*LICZBA_PRZYCISKOW];
  uint8_t chErr;
  uint32_t nCzas;

  struct etharp_entry {
  #if ARP_QUEUEING
    /** Pointer to queue of pending outgoing packets on this ARP entry. */
    struct etharp_q_entry *q;
  #else /* ARP_QUEUEING */
    /** Pointer to a single pending outgoing packet on this ARP entry. */
    struct pbuf *q;
  #endif /* ARP_QUEUEING */
    ip4_addr_t ipaddr;
    struct netif *netif;
    struct eth_addr ethaddr;
    u16_t ctime;
    u8_t state;
  };
  //extern struct etharp_entry arp_table[];
  extern struct netif gnetif;


#ifdef USE_SOCKET
  //Create the task to write to server
  osThreadDef(lwipWriteTask, WriteLWIPClientTask, osPriorityNormal, 0, 2048);
  lwipWriteTaskHandle = osThreadCreate(osThread(lwipWriteTask), NULL);

  //Create the task to read from server
  osThreadDef(lwipReadTask, ReadLWIPClientTask, osPriorityNormal, 0, 2048);
  lwipReadTaskHandle = osThreadCreate(osThread(lwipReadTask), NULL);
#endif


  osDelay(1000);

  /* Infinite loop */
  for (;;) {
    osDelay(100);

    BSP_LED_Toggle(0);
    BSP_TS_GetState(&touch);

    BSP_LCD_SelectLayer(0);
    sprintf(chNapis, "X=%d, Y=%d  ", touch.touchX[0], touch.touchY[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X1, 230, (uint8_t*)chNapis, LEFT_MODE);
    sprintf(chNapis, "T=%d, W=%d  ", touch.touchDetected, touch.touchWeight[0]);
    BSP_LCD_DisplayStringAt(KLAW_POZ_X1, 250, (uint8_t*)chNapis, LEFT_MODE);

    if (!touch.touchDetected)
    {
    	chZrobione = 0;
    }
	WykryjNacisniecie(&touch, chTabPrzyciskow);	//wykryj naciśnięcie w obrębie zdefiniowanych przycisków

    //przycisk zrób zdjęcie
    if (chTabPrzyciskow[0] && !chZrobione)
    {
    	BSP_CAMERA_SnapshotStart(bufor_okna);
    	chZrobione = 1;
    	chRodzajWyswietlania = 0;
    }

    //przycisk rozpocznij/zakończ film
    if (chTabPrzyciskow[1] && !chZrobione)
	{
    	if (chFilm)
    	{
    		BSP_CAMERA_Suspend();
    		sprintf(chNapis, "Film>");
			chFilm = 0;
    	}
    	else
    	{
			BSP_CAMERA_ContinuousStart(bufor_okna);
			sprintf(chNapis, "Film|");
			chFilm = 1;
    	}

    	//zmień status przycisku Start/Stop Film
		BSP_LCD_SelectLayer(0);
		BSP_LCD_SetTextColor(LCD_COLOR_BLACK);
		BSP_LCD_SetBackColor(LCD_COLOR_GREEN);
		BSP_LCD_DisplayStringAt(KLAW_POZ_X2+5, KLAW1_Y + NAPIS_OFFY, (uint8_t*)chNapis, LEFT_MODE);
		BSP_LCD_SetBackColor(LCD_COLOR_WHITE);	//przywróć kolor tła
		chRodzajWyswietlania = 0;
    	chZrobione = 1;
	}

    //konwersja kolor -> C/B
    if (chTabPrzyciskow[2] && !chZrobione)
    {
    	BSP_CAMERA_SnapshotStart(bufor_kamery);
		chZrobione = 1;
		chRodzajWyswietlania = TW_OBRAZ_CB;
    }

	//histogram czarno-biały
	if (chTabPrzyciskow[3] && !chZrobione)
	{
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		chZrobione = 1;
		chRodzajWyswietlania = TW_OBRAZ_CB_HIST;
	}

