pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
    //wykrywanie krawędzi Robertsa
    if (chTabPrzyciskow[4] && !chZrobione)
    {
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		chZrobione = 1;
		chRodzajWyswietlania = TW_OBRAZ_KRAW_ROB;
    }

    //wykrywanie krawędzi Sobela
    if (chTabPrzyciskow[5] && !chZrobione)
    {
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		chZrobione = 1;
		chRodzajWyswietlania = TW_OBRAZ_KRAW_SOB;
    }

 	//histogram po detekcji krawędzi
 	if (chTabPrzyciskow[6] && !chZrobione)
 	{
 		BSP_CAMERA_SnapshotStart(bufor_kamery);
 		chZrobione = 1;
 		chRodzajWyswietlania = TW_OBRAZ_KRAW_HIST;
 	}

	//histogram kolorowy
	if (chTabPrzyciskow[7] && !chZrobione)
	{
		uint8_t histR[32], histG[64], histB[32];
		nCzas = HAL_GetTick();
		HistogramRGB565(bufor_kamery, histR, histG, histB, 320*240);
		nCzas = MinalCzas(nCzas);

		//rysuj histogram na  ekranie
		BSP_LCD_SelectLayer(1);
		BSP_LCD_SetTextColor(LCD_COLOR_RED);
		for (uint8_t x=0; x<32; x++)
			BSP_LCD_FillRect(x*2, 240- *(histR+x), 1, *(histR+x));

		BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
		for (uint8_t x=0; x<64; x++)
			BSP_LCD_FillRect(x*2+64, 240- *(histG+x), 1, *(histG+x));

		BSP_LCD_SetTextColor(LCD_COLOR_BLUE);
		for (uint8_t x=0; x<32; x++)
			BSP_LCD_FillRect(x*2+192, 240- *(histB+x), 1, *(histB+x));

		sprintf(chNapis, "t=%ldms ", nCzas);
		BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
		chZrobione = 1;
		chRodzajWyswietlania = 0;
	}

 	if (chTabPrzyciskow[8] && !chZrobione)
 	{;}

	//przycisk Monitor IP
	if (chTabPrzyciskow[9] && !chZrobione)
	{
		BSP_LCD_SelectLayer(1);
		BSP_LCD_Clear(LCD_COLOR_BLACK);
		chRodzajWyswietlania = TW_MONITOR;
		chZrobione = 1;
	}


	//przycisk fraktal Julii
	if (chTabPrzyciskow[10] && !chZrobione)
	{
		InitFraktal(0);
		chRodzajWyswietlania = TW_JULIA;
		chZrobione = 1;
	}

	//przycisk fraktal Mandelbrota
	if (chTabPrzyciskow[11] && !chZrobione)
	{
		InitFraktal(1);	//Mandelbrot, rotacja kolorów palety
		chRodzajWyswietlania = TW_MANDELBROT;
		chZrobione = 1;
	}


	//cykliczne wyświetlanie
	switch(chRodzajWyswietlania)
	{

	case TW_MONITOR:
		BSP_LCD_SelectLayer(1);
		sprintf(chNapis, "WHADDR: %d.%d.%d.%d.%d.%d ", gnetif.hwaddr[0], gnetif.hwaddr[1], gnetif.hwaddr[2], gnetif.hwaddr[3], gnetif.hwaddr[4], gnetif.hwaddr[5]);
		BSP_LCD_DisplayStringAt(5, 10, (uint8_t*)chNapis, LEFT_MODE);

		uniaIP.ip = gnetif.ip_addr;
		sprintf(chNapis, "IP Addr: %d.%d.%d.%d ", uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3]);
		BSP_LCD_DisplayStringAt(5, 25, (uint8_t*)chNapis, LEFT_MODE);



		//flagi są z pliku netif.h
		sprintf(chNapis, "FLAG_UP: %d ", gnetif.flags & NETIF_FLAG_UP);
		BSP_LCD_DisplayStringAt(5, 55, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_BROADCAST: %d ", (gnetif.flags & NETIF_FLAG_BROADCAST) == NETIF_FLAG_BROADCAST);
		BSP_LCD_DisplayStringAt(5, 70, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_LINK_UP: %d ", (gnetif.flags & NETIF_FLAG_LINK_UP) == NETIF_FLAG_LINK_UP);
		BSP_LCD_DisplayStringAt(5, 85, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_ETHARP: %d", (gnetif.flags & NETIF_FLAG_ETHARP) == NETIF_FLAG_ETHARP);
		BSP_LCD_DisplayStringAt(5, 100, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_ETHERNET: %d ", (gnetif.flags & NETIF_FLAG_ETHERNET) == NETIF_FLAG_ETHERNET);
		BSP_LCD_DisplayStringAt(5, 115, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_IGMP: %d ", (gnetif.flags & NETIF_FLAG_IGMP) == NETIF_FLAG_IGMP);
		BSP_LCD_DisplayStringAt(5, 130, (uint8_t*)chNapis, LEFT_MODE);

		sprintf(chNapis, "FLAG_MLD6: %d ", (gnetif.flags & NETIF_FLAG_MLD6) == NETIF_FLAG_MLD6);
		BSP_LCD_DisplayStringAt(5, 145, (uint8_t*)chNapis, LEFT_MODE);

		//tablica ARP
		for (n=0; n<4; n++)
		{
			//PobierzEthArp(n, &uniaIP.u32);
			//uniaIP.ip = arp_table[n].ipaddr;
			//sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d, EthAdr:  %d.%d.%d.%d.%d.%d", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3], arp_table[n].ethaddr.addr[0], arp_table[n].ethaddr.addr[1], arp_table[n].ethaddr.addr[2], arp_table[n].ethaddr.addr[3], arp_table[n].ethaddr.addr[4], arp_table[n].ethaddr.addr[5]);
			//sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d, EthAdr:  %d.%d.%d.%d.%d.%d", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3], adres_eth[0], adres_eth[1], adres_eth[2], adres_eth[3], adres_eth[4], adres_eth[5]);
			sprintf(chNapis, "ARP[%d].IP: %d.%d.%d.%d ", n, uniaIP.u8[0], uniaIP.u8[1],  uniaIP.u8[2],  uniaIP.u8[3]);
			BSP_LCD_DisplayStringAt(5, 160+n*15, (uint8_t*)chNapis, LEFT_MODE);
		}
		break;

	case TW_TERMINAL:
		BSP_LCD_SelectLayer(1);
		memcpy (chNapis, chBuforTerminala, 45);		//ogranicz napis do szerokości ekranu
		chNapis[45] = 0;
		BSP_LCD_DisplayStringAt(5, chWskWiersza*15, (uint8_t*)chNapis, LEFT_MODE);
		chWskWiersza++;
		chWskWiersza &= 0x0F;				//można wyświetlić 16 wierszy
		memset(chBuforTerminala, 0, 2048); 	//wyczyść bufor
		chRodzajWyswietlania = 0;			//wyjdź z trybu terminala do czasu przyjścia kolejnego datagramu
		break;

	case TW_OBRAZ_CB:
		chErr = CzekajNaBit(&chZdjecieGotowe, 1000);	//czekaj z timeoutem na zakończenie transferu DMA
		if (!chErr)
		{
			nCzas = HAL_GetTick();
			KonwersjaRGB565doCB7((uint16_t*)bufor_kamery, bufor_czarnobialy, 320*240);
			nCzas = MinalCzas(nCzas);
			KonwersjaCB7doRGB565(bufor_czarnobialy, (uint16_t*)bufor_okna, 320*240);
			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			sprintf(chNapis, "t=%ldms ", nCzas);
			BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
		}
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		break;

	case TW_OBRAZ_KRAW_ROB:
		chErr = CzekajNaBit(&chZdjecieGotowe, 1000);	//czekaj z timeoutem na zakończenie transferu DMA
		if (!chErr)
		{
			KonwersjaRGB565doCB7((uint16_t*)bufor_kamery, bufor_czarnobialy, 320*240);

			nCzas = HAL_GetTick();
			DetekcjaKrawedziRoberts(bufor_czarnobialy, bufor_cbOut, 320, 240, 16);
			KonwersjaCB7doRGB565(bufor_cbOut, (uint16_t*)bufor_okna, 320*240);
			nCzas = MinalCzas(nCzas);
			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			sprintf(chNapis, "t=%ldms ", nCzas);
			BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
		}
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		break;

	case TW_OBRAZ_KRAW_SOB:
			chErr = CzekajNaBit(&chZdjecieGotowe, 1000);	//czekaj z timeoutem na zakończenie transferu DMA
			if (!chErr)
			{
				KonwersjaRGB565doCB7((uint16_t*)bufor_kamery, bufor_czarnobialy, 320*240);

