pitlab/Kamera-OV9655-na-STM32F746G-DISCO/Core/Src/main.c
				nCzas = HAL_GetTick();
				DetekcjaKrawedziSobel(bufor_czarnobialy, bufor_cbOut, 320, 240, 16);
				KonwersjaCB7doRGB565(bufor_cbOut, (uint16_t*)bufor_okna, 320*240);
				nCzas = MinalCzas(nCzas);
				BSP_LCD_SelectLayer(1);
				BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
				sprintf(chNapis, "t=%ldms ", nCzas);
				BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
			}
			BSP_CAMERA_SnapshotStart(bufor_kamery);
			break;

	case TW_OBRAZ_CB_HIST:		//histogram dla obrazu czarno-bialego
		chErr = CzekajNaBit(&chZdjecieGotowe, 1000);	//czekaj z timeoutem na zakończenie transferu DMA
		if (!chErr)
		{
			uint8_t hist[129];
			KonwersjaRGB565doCB7((uint16_t*)bufor_kamery, bufor_czarnobialy, 320*240);
			KonwersjaCB7doRGB565(bufor_czarnobialy, (uint16_t*)bufor_okna, 320*240);
			nCzas = HAL_GetTick();
			HistogramCB7(bufor_czarnobialy, hist, 320*240);
			nCzas = MinalCzas(nCzas);

			//rysuj histogram na  ekranie
			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			for (uint8_t x=0; x<129; x++)
			{
				BSP_LCD_FillRect(x*2, 240 - *(hist+x), 1, *(hist+x));
			}

			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			sprintf(chNapis, "t=%ldms ", nCzas);
			BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
		}
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		break;

	case TW_OBRAZ_KRAW_HIST:	//histogram dla obrazu po detekcji krawędzi
		chErr = CzekajNaBit(&chZdjecieGotowe, 1000);	//czekaj z timeoutem na zakończenie transferu DMA
		if (!chErr)
		{
			uint8_t hist[129];
			KonwersjaRGB565doCB7((uint16_t*)bufor_kamery, bufor_czarnobialy, 320*240);
			DetekcjaKrawedziRoberts(bufor_czarnobialy, bufor_cbOut, 320, 240, 0);
			KonwersjaCB7doRGB565(bufor_cbOut, (uint16_t*)bufor_okna, 320*240);
			nCzas = HAL_GetTick();
			HistogramCB7(bufor_cbOut, hist, 320*240);
			nCzas = MinalCzas(nCzas);

			//rysuj histogram na  ekranie
			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			for (uint8_t x=0; x<129; x++)
				BSP_LCD_FillRect(x*2, 240- *(hist+x), 1, *(hist+x));

			BSP_LCD_SelectLayer(1);
			BSP_LCD_SetTextColor(LCD_COLOR_GREEN);
			sprintf(chNapis, "t=%ldms ", nCzas);
			BSP_LCD_DisplayStringAt(260, 225, (uint8_t*)chNapis, LEFT_MODE);
		}
		BSP_CAMERA_SnapshotStart(bufor_kamery);
		break;

	case TW_JULIA:
		nCzas = HAL_GetTick();
		GenerateJulia(320, 240, 160, 120, 135, (unsigned short *)bufor_okna);
		fImag -= 0.002;
		nCzas = MinalCzas(nCzas);

		BSP_LCD_SelectLayer(1);
		sprintf(chNapis, "Julia: t=%ldms, c=%.3f ", nCzas, fImag);
		BSP_LCD_DisplayStringAt(6, 225, (uint8_t*)chNapis, LEFT_MODE);
		break;

	case TW_MANDELBROT:
		nCzas = HAL_GetTick();
		GenerateMandelbrot(fX, fY, fZoom, 30, (unsigned short *)bufor_okna);
		chMnozPalety += 1;
		nCzas = MinalCzas(nCzas);

		BSP_LCD_SelectLayer(1);
		sprintf(chNapis, "Mandelbrot: t=%ldms z=%.1f, p=%d", nCzas, fZoom, chMnozPalety);
		BSP_LCD_DisplayStringAt(6, 225, (uint8_t*)chNapis, LEFT_MODE);
		break;

	default:	break;
	}
  }
  /* USER CODE END 5 */
}

 /* MPU Configuration */

void MPU_Config(void)
{
  MPU_Region_InitTypeDef MPU_InitStruct = {0};

  /* Disables the MPU */
  HAL_MPU_Disable();

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1;
  MPU_InitStruct.BaseAddress = 0x20010000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_128KB;
  MPU_InitStruct.SubRegionDisable = 0x0;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL1;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_DISABLE;
  MPU_InitStruct.IsShareable = MPU_ACCESS_NOT_SHAREABLE;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);

  /** Initializes and configures the Region and the memory to be protected
  */
  MPU_InitStruct.Number = MPU_REGION_NUMBER2;
  MPU_InitStruct.BaseAddress = 0x2004C000;
  MPU_InitStruct.Size = MPU_REGION_SIZE_512B;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_BUFFERABLE;

  HAL_MPU_ConfigRegion(&MPU_InitStruct);
  /* Enables the MPU */
  HAL_MPU_Enable(MPU_PRIVILEGED_DEFAULT);

}

/**
  * @brief  Period elapsed callback in non blocking mode
  * @note   This function is called  when TIM6 interrupt took place, inside
  * HAL_TIM_IRQHandler(). It makes a direct call to HAL_IncTick() to increment
  * a global variable "uwTick" used as application time base.
  * @param  htim : TIM handle
  * @retval None
  */
void HAL_TIM_PeriodElapsedCallback(TIM_HandleTypeDef *htim)
{
  /* USER CODE BEGIN Callback 0 */

  /* USER CODE END Callback 0 */
  if (htim->Instance == TIM6) {
    HAL_IncTick();
  }
  /* USER CODE BEGIN Callback 1 */

  /* USER CODE END Callback 1 */
}

/**
  * @brief  This function is executed in case of error occurrence.
  * @retval None
  */
void Error_Handler(void)
{
  /* USER CODE BEGIN Error_Handler_Debug */
  /* User can add his own implementation to report the HAL error return state */
  __disable_irq();
  while (1)
  {
  }
  /* USER CODE END Error_Handler_Debug */
}

#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t *file, uint32_t line)
{
  /* USER CODE BEGIN 6 */
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */
  /* USER CODE END 6 */
}
#endif /* USE_FULL_ASSERT */
